#pragma once

//-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
//
//		CPP Lib
//
//-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
#include <iostream>





//-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
//
//		SFML lib
//
//-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
#include <SFML/Graphics.hpp>




//-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
//
//		[ Macro ] -> Exit the program
//
//-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
#define SUCCESS_EXIT_CODE	0;
#define FAILURE_EXIT__CODE	1;


namespace slrconst
{
    const double G = 6.67430e-11;       // Всемирная гравитационная постоянная (м^3·кг^−1·с^−2)
    const double c = 299792458;         // Скорость света в вакууме (м/с)
    const double h = 6.62607015e-34;    // Планковская постоянная (Дж·с)
    const double k = 1.380649e-23;      // Постоянная Больцмана (Дж/К)
    const double R = 8.314;             // Универсальная газовая постоянная (Дж/(моль·К))
}


const int WIN_WIDTH = 1280;
const int WIN_HEIGHT = 940;
const float CRASH_DIST = 10.0f;
const float OUT_DIST = 1000.0f;
const float X0 = WIN_WIDTH / 2.0f; // Позиция Солнца
const float Y0 = WIN_HEIGHT / 2.0f; // Позиция Солнца